depot/app/controllers/admin_controller.rb

  def index
    set_cart
    @total_orders = Order.count
---
SELECT COUNT(*) FROM `orders`