depot/app/controllers/carts_controller.rb

  def destroy
    @cart = current_cart
    @cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM `carts` WHERE `carts`.`id` = 8