depot/app/controllers/line_items_controller.rb

  def create

    @cart =current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 ORDER BY title LIMIT 1
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `updated_at`) VALUES (9, '2014-03-12 08:54:27', 4, '2014-03-12 08:54:27')
UPDATE `line_items` SET `quantity` = 9, `updated_at` = '2014-03-12 07:40:28' WHERE `line_items`.`id` = 24