depot/app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    set_cart
    @orders = Order.all

SELECT 1 AS one FROM `line_items` WHERE `line_items`.`cart_id` = 45 LIMIT 1
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 45
---
  def new
    @cart =current_cart
    if @cart.line_items.empty?

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-03-13 03:20:49', '2014-03-13 03:20:49')
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('Enclave', '2014-03-13 03:10:14', 'kurt@gmail.com', 'Kurt', 'Check', '2014-03-13 03:10:14')
DELETE FROM `carts` WHERE `carts`.`id` = 45
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])