depot/app/controllers/sessions_controller.rb

  def create
    set_cart
    user = User.find_by(name: params[:name])
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = '' LIMIT 1