depot/app/controllers/users_controller.rb

  def index
    set_cart
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC

  def create
    set_cart
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2014-03-13 08:02:32', 'kurt', '$2a$10$VPYGzqkLN0IEW1.6njUgOur4JmlFtZ9/Yolhzy9Utkdh7MCeoTu4O', '2014-03-13 08:02:32')