depot/app/views/store/index.html.erb


<% cache ['store', Product.last] do %>
---
SELECT `products`.* FROM `products` ORDER BY title DESC LIMIT 1